app/controllers/students_controller.rb

SELECT "schools".* FROM "schools"
---
  def new
    @schools = School.all

INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "Ben"], ["age", 12], ["created_at", "2020-01-10 21:11:21.466004"], ["updated_at", "2020-01-10 21:11:21.466004"], ["school_id", 24]]
---
  def create
    @student = Student.create(student_params)

SELECT "schools".* FROM "schools"
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @schools = School.all
    @student = Student.find(params[:id])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "students" SET "school_id" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["school_id", 23], ["updated_at", "2020-01-10 19:02:12.955909"], ["id", 9]]
---
  def update
    @student = Student.find(params[:id])
    @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."student_id" = ?  [["student_id", 8]]
---
  def searched
    @students = Student.search(params[:search])