app/models/student.rb

    def self.search(search)
        students = Student.find_by(name: search)
---
SELECT  "students".* FROM "students" WHERE "students"."name" = ? LIMIT ?  [["name", "Jacob"], ["LIMIT", 1]]